In [27]:
import pandas as pd
import numpy as np

In [28]:
import os
data_path = '/home/pavel/P/kaggle_data/talking_data'

In [29]:
import sys

In [30]:
events = pd.read_csv(os.path.join(data_path, 'events.csv'), dtype={'event_id': np.int64, 'device_id': np.int64,
                                                                  'longitude': np.float16, 'latitude': np.float16})

In [31]:
events.head()

   event_id            device_id            timestamp  longitude   latitude
0         1    29182687948017175  2016-05-01 00:55:25    121.375  31.234375
1         2 -6401643145415154744  2016-05-01 00:54:12    103.625  30.968750
2         3 -4833982096941402721  2016-05-01 00:08:05    106.625  29.703125
3         4 -6815121365017318426  2016-05-01 00:06:40    104.250  23.281250
4         5 -5373797595892518570  2016-05-01 00:07:18    115.875  28.656250

In [32]:
gender_age_train = pd.read_csv(os.path.join(data_path, 'gender_age_train.csv'), dtype={'device_id': np.int64,
                                                                                      'age': np.int8})

In [33]:
gender_age_train.head()

             device_id gender  age   group
0 -8076087639492063270      M   35  M32-38
1 -2897161552818060146      M   35  M32-38
2 -8260683887967679142      M   35  M32-38
3 -4938849341048082022      M   30  M29-31
4   245133531816851882      M   30  M29-31

In [34]:
all_df_1 = pd.merge(events, gender_age_train, on='device_id', how='inner')

In [35]:
all_df_1.head()

,event_id,device_id,timestamp,longitude,latitude,gender,age,group
0,1,29182687948017175,2016-05-01 00:55:25,121.3750,31.234375,M,46,M39+
1,7104,29182687948017175,2016-05-02 09:37:02,121.3750,31.234375,M,46,M39+
2,29661,29182687948017175,2016-05-04 00:56:04,121.3750,31.234375,M,46,M39+
3,33133,29182687948017175,2016-05-06 05:01:15,121.3750,31.234375,M,46,M39+
4,38980,29182687948017175,2016-05-06 09:55:04,121.1875,31.000000,M,46,M39+

In [36]:
all_df_1.shape

(1215595, 8)

In [37]:
phone_brand_device_model = pd.read_csv(os.path.join(data_path, 'phone_brand_device_model.csv'),
                                       dtype={'device_id': np.int64})

In [38]:
brand_mapping = pd.read_csv(os.path.join(data_path, 'brand_mapping.csv'), names=('phone_brand', 'en_name'))

In [39]:
phone_brand_device_model_1 = pd.merge(phone_brand_device_model, brand_mapping, how='inner', on='phone_brand')

In [40]:
phone_brand_device_model_1.head()

             device_id phone_brand   device_model  en_name
0  5137427614288105724          三星      Galaxy S4  samsung
1 -5019277647504317457          三星  Galaxy Note 2  samsung
2  5840378295166286440          三星      Galaxy S3  samsung
3  3437705102632680210          三星      Galaxy S3  samsung
4 -3568334676360016285          三星      Galaxy S3  samsung

In [41]:
all_df_3 = pd.merge(all_df_1, phone_brand_device_model_1, on='device_id', how='left')
print all_df_3.shape

(1217601, 11)

In [42]:
all_df_3[all_df_3['en_name']=='samsung'].head()

,event_id,device_id,timestamp,longitude,latitude,gender,age,group,phone_brand,device_model,en_name
1543,27,-2668732172869127974,2016-05-01 00:46:35,132.000,47.2500,M,53,M39+,三星,Galaxy S4,samsung
1544,2575,-2668732172869127974,2016-05-01 04:22:50,132.000,47.2500,M,53,M39+,三星,Galaxy S4,samsung
1545,2657,-2668732172869127974,2016-05-03 04:45:49,132.000,47.2500,M,53,M39+,三星,Galaxy S4,samsung
1546,9902,-2668732172869127974,2016-05-07 10:41:04,132.000,47.2500,M,53,M39+,三星,Galaxy S4,samsung
1547,13987,-2668732172869127974,2016-05-06 13:30:02,132.125,47.3125,M,53,M39+,三星,Galaxy S4,samsung

In [43]:
# удаление лишних столбцов
all_clear = all_df_3.drop(['device_id', 'phone_brand', 'device_model'], axis=1)

In [44]:
all_clear.head()

,event_id,timestamp,longitude,latitude,gender,age,group,en_name
0,1,2016-05-01 00:55:25,121.3750,31.234375,M,46,M39+,NaN
1,7104,2016-05-02 09:37:02,121.3750,31.234375,M,46,M39+,NaN
2,29661,2016-05-04 00:56:04,121.3750,31.234375,M,46,M39+,NaN
3,33133,2016-05-06 05:01:15,121.3750,31.234375,M,46,M39+,NaN
4,38980,2016-05-06 09:55:04,121.1875,31.000000,M,46,M39+,NaN

In [45]:
sys.path.append('/home/pavel/P/kaggle_1/')

In [46]:
from kaggle.functions import ohe_df

In [47]:
all_ohe = ohe_df(all_clear, ohe_feats=['en_name'])

In [48]:
all_ohe.head()

,event_id,timestamp,longitude,latitude,gender,age,group,en_name_Ktouch,en_name_ada,en_name_aiyouni,...,en_name_panosonic,en_name_samsung,en_name_weimi,en_name_weitu,en_name_wpf,en_name_xiangmi,en_name_ximi,en_name_yougo,en_name_youmi,en_name_yuxin
0,1,2016-05-01 00:55:25,121.3750,31.234375,M,46,M39+,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,7104,2016-05-02 09:37:02,121.3750,31.234375,M,46,M39+,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,29661,2016-05-04 00:56:04,121.3750,31.234375,M,46,M39+,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,33133,2016-05-06 05:01:15,121.3750,31.234375,M,46,M39+,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,38980,2016-05-06 09:55:04,121.1875,31.000000,M,46,M39+,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

### Кросс-валидация

In [49]:
from xgboost.sklearn import XGBClassifier

fxgb = lambda: XGBClassifier(max_depth=6, learning_rate=0.3, n_estimators=25, nthread=-1, 
                             objective='multi:softprob', subsample=1, colsample_bytree=0.5, seed=1234)

In [50]:
from sklearn.metrics import log_loss
from kaggle.models import cross_validation_score

In [51]:
X = all_ohe.drop(['event_id', 'gender', 'age', 'group', 'timestamp'], axis=1)
y = all_ohe['group']

In [52]:
model = fxgb()

In [53]:
cross_validation_score(model, X.values, y, func=log_loss)

2.4014886695968012